## Modulo — модуль деления, введение в Java 008

**Modulo** — в специализированной литературе "modulo" называется оператором деления по модулю или взятием модуля деления. В Java обозначается знаком "процентов" - %. 

Используется это в программировании, например для перевода десятичных чисел в двоичные. Не надо путать этот оператор с делением "/".
Замечу, что в Википедии на данный момент по запросу modulo выводится статья про "деление с остатком" . На мой взгляд это очень сильно дезориентирующие определение. **Модуль деления** — это вычисление остатка от деления целых чисел. Хотелось бы привести оба оператора и показать разницу.

```
56 % 24 = 8;
56 / 24 = 2;
```

24 дважды помещается в 56 и ещё в остатке имеем 8. Читается это так :
— Целочисленный остаток от деления 56 на 24 равно 8.

Я выговариваю это так: "56 модуло 24 равно 8"

С делением дела обстоят немного по другому. Если мы говорим только о целых числах **"int"**, то при делении 56 на 24 получаем 2.

Простейший пример в Java выглядит вот так:

```Java
public class Modulo {
    public static void main (String[] args ) {
        int x = 85;
        int y = 7;
 
        System.out.println(x + " mod "+ y + " = " + x % 7);
        System.out.println(x + " / "+ y + " = " + x / 7);
    }
}
```

На экране мы получаем:

```
85 mod 7 = 1
85 / 7 = 12
```

## Дополнительная литература

1. [Деление с остатком](https://ru.wikipedia.org/wiki/%D0%94%D0%B5%D0%BB%D0%B5%D0%BD%D0%B8%D0%B5_%D1%81_%D0%BE%D1%81%D1%82%D0%B0%D1%82%D0%BA%D0%BE%D0%BC)

## Домашнее задание

1. Напишите программу, которая находит чётные числа.
2. Напишите программу, которая находит нечётные числа.
3. Напишите программу, которая находит числа кратные 11.
4. Напишите программу, которая находит простые числа.
5. Дано число меньше 3000. При делении числа на 32 получается остаток 30, при делении на 58 - остаток 44. Найдите число или числа.
6. Напишите программу, которая проверяет год на високосность. Кратный четырём.
7. Прочитайте в Википедии, какие года являются високосными и дополните предыдущую задачу.

